Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.ProblemWithPeopleLoadWarn Property
 [Room]'s number of people or people load (sensible or latent) is too high. This may be caused by an incorrect density value and must be corrected before this space can be included in the load calculations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProblemWithPeopleLoadWarn { get; }
Public Shared ReadOnly Property ProblemWithPeopleLoadWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProblemWithPeopleLoadWarn {
	FailureDefinitionId^ get ();
}
static member ProblemWithPeopleLoadWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace